In [1]:
import pandas as pd

In [2]:
# dataframe
data = {'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']}
countries = pd.DataFrame(data)
countries = countries.set_index('country') # 인덱스 지정
countries

                population    area    capital
country
Belgium               11.3   30510   Brussels
France                64.3  671308      Paris
Germany               81.3  357050     Berlin
Netherlands           16.9   41526  Amsterdam
United Kingdom        64.9  244820     London

In [3]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Belgium to United Kingdom
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   population  5 non-null      float64
 1   area        5 non-null      int64
 2   capital     5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

---

<div class="alert alert-success">
    <b>EXERCISE</b>: 인구밀도를 의미하는 `density` 칼럼을 추가하세요. (주의: 현재 'population' 칼럼은 100만 단위로 표기되어 있습니다)  
  
</div>

In [4]:
countries['density']=''
countries['density']=countries['population']*1000000 / countries['area']
countries

                population    area    capital     density
country
Belgium               11.3   30510   Brussels  370.370370
France                64.3  671308      Paris   95.783158
Germany               81.3  357050     Berlin  227.699202
Netherlands           16.9   41526  Amsterdam  406.973944
United Kingdom        64.9  244820     London  265.092721

<div class="alert alert-success">
    <b>EXERCISE</b>: 인구밀도가 300을 초과하는 국가(country)의 수도(capital)과 인구(population)을 선택해주세요.  
  
</div>

In [5]:
countries[(countries['density']>300)]

             population   area    capital     density
country
Belgium            11.3  30510   Brussels  370.370370
Netherlands        16.9  41526  Amsterdam  406.973944

In [6]:
c1=countries.loc[(countries['density']>300),['capital','population']]
c1

               capital  population
country
Belgium       Brussels        11.3
Netherlands  Amsterdam        16.9

<div class="alert alert-success">
    <b>EXERCISE</b>: 'density_ratio' 칼럼을 추가해주세요. (density_ratio = 인구밀도/평균 인구밀도)
</div>

In [7]:
c0=countries.describe()
c0

       population           area     density
count    5.000000       5.000000    5.000000
mean    47.740000  269042.800000  273.183879
std     31.519645  264012.827994  123.440607
min     11.300000   30510.000000   95.783158
25%     16.900000   41526.000000  227.699202
50%     64.300000  244820.000000  265.092721
75%     64.900000  357050.000000  370.370370
max     81.300000  671308.000000  406.973944

In [8]:
c0=countries.describe()
c00=int(c0.iloc[1,2])
type(c00)

int

In [9]:
countries['density_ratio']=''
countries['density_ratio']=countries['density']/ c00
countries

                population    area    capital     density  density_ratio
country
Belgium               11.3   30510   Brussels  370.370370       1.356668
France                64.3  671308      Paris   95.783158       0.350854
Germany               81.3  357050     Berlin  227.699202       0.834063
Netherlands           16.9   41526  Amsterdam  406.973944       1.490747
United Kingdom        64.9  244820     London  265.092721       0.971036

<div class="alert alert-success">
    <b>EXERCISE</b>: 영국(United Kingdom)의 수도(capital)를 'Cambridge'로 변경해주세요.
</div>

In [10]:
countries.columns

Index(['population', 'area', 'capital', 'density', 'density_ratio'], dtype='object')

In [11]:
countries[['capital']]

                  capital
country
Belgium          Brussels
France              Paris
Germany            Berlin
Netherlands     Amsterdam
United Kingdom     London

In [12]:
countries.iloc[4,2]='Cambridge'
countries[['capital']]

                  capital
country
Belgium          Brussels
France              Paris
Germany            Berlin
Netherlands     Amsterdam
United Kingdom  Cambridge

<div class="alert alert-success">
    <b>EXERCISE</b>: 인구 밀도가 100 초과, 300 미만인 국가들을 표시해주세요.  
</div>

In [13]:
countries[(countries['density']>100 ) & (countries['density']<300)]

                population    area    capital     density  density_ratio
country
Germany               81.3  357050     Berlin  227.699202       0.834063
United Kingdom        64.9  244820  Cambridge  265.092721       0.971036

<div class="alert alert-success">
    <b>EXERCISE</b>: 수도가 7글자 이상인 국가들을 표시해주세요. (힌트: string의 len( )를 사용하세요.)
</div>

In [14]:
# capital의 값들을 리스트로 만듦
# 그리스트에서 각요소가 len(7) 이상이면 나오도록

In [15]:
cap_list=str(list(countries['capital']))

In [16]:
print(type(cap_list), cap_list)

<class 'str'> ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'Cambridge']

In [17]:
countries['capital'].apply(lambda x: len(x)>7)

country
Belgium            True
France            False
Germany           False
Netherlands        True
United Kingdom     True
Name: capital, dtype: bool

<div class="alert alert-success">
    <b>EXERCISE</b>: 수도에 'am' 이 포함되는 국가들을 표시해주세요. (힌트: string의 contains( )를 사용하세요.)
</div>

In [18]:
# am이 포함되려면 . str.contains("am")
# 국가들만 표시되게 해두셨네...

In [19]:
countries['capital'].str.contains("am")

country
Belgium           False
France            False
Germany           False
Netherlands        True
United Kingdom     True
Name: capital, dtype: bool

# 영화리뷰 데이터에서 자료 찾기

movie_title_data.tsv 읽어오기

In [20]:
# 엔진설치하는게 아니라 구분자(sep를 수정해야함)
import pandas as pd

In [151]:
titles = pd.read_csv("./data/movie_title_data.tsv", sep='\t', low_memory=False)
titles

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
...,...,...,...,...,...,...,...,...,...
8407394,tt9916848,tvEpisode,Episode #3.17,Episode #3.17,0,2010,\N,\N,"Action,Drama,Family"
8407395,tt9916850,tvEpisode,Episode #3.19,Episode #3.19,0,2010,\N,\N,"Action,Drama,Family"
8407396,tt9916852,tvEpisode,Episode #3.20,Episode #3.20,0,2010,\N,\N,"Action,Drama,Family"
8407397,tt9916856,short,The Wind,The Wind,0,2015,\N,27,Short
8407398,tt9916880,tvEpisode,Horrid Henry Knows It All,Horrid Henry Knows It All,0,2014,\N,10,"Adventure,Animation,Comedy"

# 파일받는곳

https://drive.google.com/file/d/1cvBtLVyfhfodJK-BXWqBLcopyus9HOIc/view?usp=sharing

<div class="alert alert-success">
    <b>EXERCISE</b>: titles 데이터프레임에는 몇 개의 영화가 기록되어 있나요?
</div>

In [22]:
# 중복값 먼저 삭제한 후 info, describe 보기
titles.drop_duplicates(subset=['originalTitle']).head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [23]:
# 중복값 제거하려고보니 4개만 남아서 그냥 조회하기로함
titles.describe()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
count,8407399,8407399,8407385,8407385,8407399,8407399,8407399,8407399,8407389
unique,8407399,11,4000746,4019695,9,150,97,856,2296
top,tt9916880,tvEpisode,Episode #1.1,Episode #1.1,0,\N,\N,\N,Drama
freq,1,6181300,41344,41344,8149047,1023113,8323674,6046784,924802

In [24]:
# 타이틀의 유니크값 : 4000746 or 4019695
# 타이틀이 키라고 생각했음.

# startYear같이 <br>astype이 안되는 유형들은<br> unique로 특수기호는 없는지 살펴야함.

In [153]:
# startYear 같은 데이터는 아래와같이 str 화 먼저하고
titles['startYear'].apply(str)
# 그리고 나서 unique, isna를 돌려서 필터링.

0          1894
1          1892
2          1892
3          1892
4          1893
           ...
8407394    2010
8407395    2010
8407396    2010
8407397    2015
8407398    2014
Name: startYear, Length: 8407399, dtype: object

In [154]:
titles['startYear'].isna().sum()

np.int64(0)

<div class="alert alert-success">
    <b>EXERCISE</b>: titles에서 가장 빠른 시기에 제작된 영화 두 개를 표시하세요.  힌트: .sort_values()
</div>

In [25]:
# 가장 빠른 시기이려면 값이 커야함
#titles['startYear'].value_counts(ascending=False)
# /N이 아닌 것들만 나오게해얌

In [26]:
titles[titles['startYear'] != "\\N"].sort_values(by="startYear", ascending=False)[:2]

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
3158370,tt13907072,movie,Skyscraper on an Uninhabited Island 4,Skyscraper on an Uninhabited Island 4,0,2028,\N,\N,"Adventure,Sci-Fi"
6427631,tt5637536,movie,Avatar 5,Avatar 5,0,2028,\N,\N,"Action,Adventure,Drama"

<div class="alert alert-success">
    <b>EXERCISE</b>: 제목(title)이 "Hamlet"인 영화는 몇 개가 있나요?
</div>

In [27]:
# 제목이 Hamlet이려면?
# originalTitle을 str로 변환해야함
titles['originalTitle'].str.contains("Hamlet").sum()

417

<div class="alert alert-success">
    <b>EXERCISE</b>: 제목(title)이 "Treasure Island"인 영화를 제작년도(year)의 오름차순에 따라 표시하세요
</div>

In [28]:
titles[titles['originalTitle'] == "Treasure Island"].sort_values(by="startYear", ascending=True)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
2511,tt0002538,short,Treasure Island,Treasure Island,0,1912,\N,\N,"Adventure,Short"
5032142,tt2440348,short,Treasure Island,Treasure Island,0,1913,\N,\N,"Short,Thriller"
9589,tt0009721,movie,Treasure Island,Treasure Island,0,1917,\N,60,Adventure
11620,tt0011785,movie,Treasure Island,Treasure Island,0,1920,\N,76,Adventure
25459,tt0025907,movie,Treasure Island,Treasure Island,0,1934,\N,110,"Adventure,Family"
...,...,...,...,...,...,...,...,...,...
1431503,tt10815740,tvEpisode,Treasure Island,Treasure Island,0,2019,\N,\N,Comedy
3809301,tt15075064,tvEpisode,Treasure Island,Treasure Island,0,2021,\N,\N,"Animation,Comedy"
4323630,tt1659339,movie,Treasure Island,Treasure Island,0,\N,\N,\N,Adventure
7838572,tt8709864,tvSeries,Treasure Island,Treasure Island,0,\N,\N,\N,Reality-TV
1574276,tt11064450,movie,Treasure Island,Treasure Island,0,\N,\N,\N,Adventure

<div class="alert alert-success">
    <b>EXERCISE</b>: 1950년에서 1959년 사이 몇 개의 영화가 만들어졌나요?(1950 <= 제작년도 <= 1959)
</div>

In [29]:
nn=titles[titles['startYear'] != "\\N"].sort_values(by="startYear", ascending=False)
nnn=pd.DataFrame(nn)

In [30]:
nnn['startYear']=nnn['startYear'].astype('int64')

In [31]:
nnn[(nnn['startYear'] != "\\N") & (1950<=nnn['startYear']) & (nnn['startYear']<=1959)].sort_values(by="startYear", ascending=True)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
4359337,tt1696345,tvEpisode,Rumba Lessons,Rumba Lessons,0,1950,\N,\N,Comedy
601232,tt0622539,tvEpisode,The Green Pack,The Green Pack,0,1950,\N,60,Drama
1207542,tt10421916,tvEpisode,No Soap,No Soap,0,1950,\N,\N,"Action,Crime,Drama"
251491,tt0262337,movie,La ciudad perdida,La ciudad perdida,0,1950,\N,90,Drama
2258476,tt12276004,tvEpisode,Episode dated 12 June 1950,Episode dated 12 June 1950,0,1950,\N,\N,\N
...,...,...,...,...,...,...,...,...,...
720181,tt0743109,tvEpisode,The Elizabeth McQueeny Story,The Elizabeth McQueeny Story,0,1959,\N,60,Western
694588,tt0717117,tvEpisode,Bob Dawson,Bob Dawson,0,1959,\N,30,Western
374508,tt0390461,movie,Shadow,Saye,0,1959,\N,100,Drama
3786077,tt1503297,tvEpisode,Episode #1.283,Episode #1.283,0,1959,\N,\N,Drama
236513,tt0246649,movie,Kelian nu,Kelian nu,0,1959,\N,\N,Drama

In [32]:
nnn[(nnn['startYear'] != "\\N") & (1950<=nnn['startYear']) & (nnn['startYear']<=1959)].sort_values(by="startYear", ascending=True).info

<bound method DataFrame.info of              tconst  titleType                  primaryTitle  \
4359337   tt1696345  tvEpisode                 Rumba Lessons
601232    tt0622539  tvEpisode                The Green Pack
1207542  tt10421916  tvEpisode                       No Soap
251491    tt0262337      movie             La ciudad perdida
2258476  tt12276004  tvEpisode    Episode dated 12 June 1950
...             ...        ...                           ...
720181    tt0743109  tvEpisode  The Elizabeth McQueeny Story
694588    tt0717117  tvEpisode                    Bob Dawson
374508    tt0390461      movie                        Shadow
3786077   tt1503297  tvEpisode                Episode #1.283
236513    tt0246649      movie                     Kelian nu

                        originalTitle isAdult  startYear endYear  \
4359337                 Rumba Lessons       0       1950      \N
601232                 The Green Pack       0       1950      \N
1207542                       No Soap       0       1950      \N
251491              La ciudad perdida       0       1950      \N
2258476    Episode dated 12 June 1950       0       1950      \N
...                               ...     ...        ...     ...
720181   The Elizabeth McQueeny Story       0       1959      \N
694588                     Bob Dawson       0       1959      \N
374508                           Saye       0       1959      \N
3786077                Episode #1.283       0       1959      \N
236513                      Kelian nu       0       1959      \N

        runtimeMinutes              genres
4359337             \N              Comedy
601232              60               Drama
1207542             \N  Action,Crime,Drama
251491              90               Drama
2258476             \N                  \N
...                ...                 ...
720181              60             Western
694588              30             Western
374508             100               Drama
3786077             \N               Drama
236513              \N               Drama

[118649 rows x 9 columns]>

## tconst를 기준으로 중복 값 찾기

# 타이타닉 자료에서 그룹별 연산하기

원격 DB에 접속해서 titanic 데이터베이스 안에 있는 p_info, t_info, survived 테이블을 불러와 합치고 아래의 문제를 풀어보세요.<br>
<id:kict00, pw:kict00, ip:221.155.18.165:3306, db:titanic>

In [35]:
# db연결 준비
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb

In [36]:
# db연결
engine=create_engine("mysql+pymysql://kict15:kict15@221.155.18.165:3306/titanic")
conn = engine.connect()
p_info =  pd.read_sql("p_info", con=conn)
t_info =  pd.read_sql("t_info", con=conn)
survived =  pd.read_sql("survived", con=conn)
conn.close()         # 쿼리를 직접 작성하게 명령도 가능한 부분.

In [43]:
# 합치기 전 shape
print(p_info,len(p_info))
print(t_info,len(t_info))
print(survived,len(survived))
# len으로 돌렸는데 왜똑같지. ㅇ0ㅇ
# 공통컬럼이 PassengerId 라는걸 파악.

     PassengerId                                               Name     Sex  \
0              1                            Braund, Mr. Owen Harris    male
1              2  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2              3                             Heikkinen, Miss. Laina  female
3              4       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4              5                           Allen, Mr. William Henry    male
..           ...                                                ...     ...
886          887                              Montvila, Rev. Juozas    male
887          888                       Graham, Miss. Margaret Edith  female
888          889           Johnston, Miss. Catherine Helen "Carrie"  female
889          890                              Behr, Mr. Karl Howell    male
890          891                                Dooley, Mr. Patrick    male

      Age  SibSp  Parch
0    22.0      1      0
1    38.0      1      0
2    26.0      0      0
3    35.0      1      0
4    35.0      0      0
..    ...    ...    ...
886  27.0      0      0
887  19.0      0      0
888   NaN      1      2
889  26.0      0      0
890  32.0      0      0

[891 rows x 6 columns] 891
     PassengerId            Ticket  Pclass     Fare Cabin Embarked
0              1         A/5 21171       3   7.2500  None        S
1              2          PC 17599       1  71.2833   C85        C
2              3  STON/O2. 3101282       3   7.9250  None        S
3              4            113803       1  53.1000  C123        S
4              5            373450       3   8.0500  None        S
..           ...               ...     ...      ...   ...      ...
886          887            211536       2  13.0000  None        S
887          888            112053       1  30.0000   B42        S
888          889        W./C. 6607       3  23.4500  None        S
889          890            111369       1  30.0000  C148        C
890          891            370376       3   7.7500  None        Q

[891 rows x 6 columns] 891
     PassengerId  Survived
0              1         0
1              2         1
2              3         1
3              4         1
4              5         0
..           ...       ...
886          887         0
887          888         1
888          889         0
889          890         1
890          891         0

[891 rows x 2 columns] 891

### 공통되는 컬럼인 PassengerId 에 set_index
- 근데 어느 df에 해야하지?
- set_index 틀
    - df= df.set_index('컬럼')
- join 틀
    - 합칠것1.join( 합칠것2 )

In [46]:
p_info = p_info.set_index('PassengerId')
t_info = t_info.set_index('PassengerId')

print(p_info)
print(t_info)

                                                          Name     Sex   Age  \
PassengerId
1                                      Braund, Mr. Owen Harris    male  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3                                       Heikkinen, Miss. Laina  female  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
5                                     Allen, Mr. William Henry    male  35.0
...                                                        ...     ...   ...
887                                      Montvila, Rev. Juozas    male  27.0
888                               Graham, Miss. Margaret Edith  female  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"  female   NaN
890                                      Behr, Mr. Karl Howell    male  26.0
891                                        Dooley, Mr. Patrick    male  32.0

             SibSp  Parch
PassengerId
1                1      0
2                1      0
3                0      0
4                1      0
5                0      0
...            ...    ...
887              0      0
888              0      0
889              1      2
890              0      0
891              0      0

[891 rows x 5 columns]
                       Ticket  Pclass     Fare Cabin Embarked
PassengerId
1                   A/5 21171       3   7.2500  None        S
2                    PC 17599       1  71.2833   C85        C
3            STON/O2. 3101282       3   7.9250  None        S
4                      113803       1  53.1000  C123        S
5                      373450       3   8.0500  None        S
...                       ...     ...      ...   ...      ...
887                    211536       2  13.0000  None        S
888                    112053       1  30.0000   B42        S
889                W./C. 6607       3  23.4500  None        S
890                    111369       1  30.0000  C148        C
891                    370376       3   7.7500  None        Q

[891 rows x 5 columns]

In [47]:
pt= p_info.join(t_info)
pt

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,None,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S
5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,2,13.0000,None,S
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,3,23.4500,None,S
890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,1,30.0000,C148,C
891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,3,7.7500,None,Q

In [50]:
survived = survived.set_index('PassengerId')
survived

             Survived
PassengerId
1                   0
2                   1
3                   1
4                   1
5                   0
...               ...
887                 0
888                 1
889                 0
890                 1
891                 0

[891 rows x 1 columns]

In [51]:
# survived와 pt를 합치기
pts=pt.join(survived)
pts

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,None,S,0
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S,0
...,...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,2,13.0000,None,S,0
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S,1
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,3,23.4500,None,S,0
890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,1,30.0000,C148,C,1
891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,3,7.7500,None,Q,0

In [55]:
print(pts.columns)
print(pts.describe)

Index(['Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Pclass', 'Fare',
       'Cabin', 'Embarked', 'Survived'],
      dtype='object')
<bound method NDFrame.describe of                                                           Name     Sex   Age  \
PassengerId
1                                      Braund, Mr. Owen Harris    male  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3                                       Heikkinen, Miss. Laina  female  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
5                                     Allen, Mr. William Henry    male  35.0
...                                                        ...     ...   ...
887                                      Montvila, Rev. Juozas    male  27.0
888                               Graham, Miss. Margaret Edith  female  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"  female   NaN
890                                      Behr, Mr. Karl Howell    male  26.0
891                                        Dooley, Mr. Patrick    male  32.0

             SibSp  Parch            Ticket  Pclass     Fare Cabin Embarked  \
PassengerId
1                1      0         A/5 21171       3   7.2500  None        S
2                1      0          PC 17599       1  71.2833   C85        C
3                0      0  STON/O2. 3101282       3   7.9250  None        S
4                1      0            113803       1  53.1000  C123        S
5                0      0            373450       3   8.0500  None        S
...            ...    ...               ...     ...      ...   ...      ...
887              0      0            211536       2  13.0000  None        S
888              0      0            112053       1  30.0000   B42        S
889              1      2        W./C. 6607       3  23.4500  None        S
890              0      0            111369       1  30.0000  C148        C
891              0      0            370376       3   7.7500  None        Q

             Survived
PassengerId
1                   0
2                   1
3                   1
4                   1
5                   0
...               ...
887                 0
888                 1
889                 0
890                 1
891                 0

[891 rows x 11 columns]>

<div class="alert alert-success">
    <b>EXERCISE</b>: 데이터의 상위 5개 행을 출력하세요.
</div>

In [56]:
pts.head(5)

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,None,S,0
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S,0

<div class="alert alert-success">
    <b>EXERCISE</b>: 데이터의 정보(info)를 출력하세요.
</div>

In [57]:
pts.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      891 non-null    object
 1   Sex       891 non-null    object
 2   Age       714 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Ticket    891 non-null    object
 6   Pclass    891 non-null    int64
 7   Fare      891 non-null    float64
 8   Cabin     204 non-null    object
 9   Embarked  889 non-null    object
 10  Survived  891 non-null    int64
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

<div class="alert alert-success">
    <b>EXERCISE</b>: 데이터의 기술통계(describe)를 확인하세요.
</div>

In [58]:
pts.describe()

              Age       SibSp       Parch      Pclass        Fare    Survived
count  714.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean    29.699118    0.523008    0.381594    2.308642   32.204208    0.383838
std     14.526497    1.102743    0.806057    0.836071   49.693429    0.486592
min      0.420000    0.000000    0.000000    1.000000    0.000000    0.000000
25%     20.125000    0.000000    0.000000    2.000000    7.910400    0.000000
50%     28.000000    0.000000    0.000000    3.000000   14.454200    0.000000
75%     38.000000    1.000000    0.000000    3.000000   31.000000    1.000000
max     80.000000    8.000000    6.000000    3.000000  512.329200    1.000000

<div class="alert alert-success">
    <b>EXERCISE</b>: 처음 100명의 데이터를 출력하세요.
</div>

In [60]:
pts[0:100]

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,None,S,0
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S,0
...,...,...,...,...,...,...,...,...,...,...,...
96,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,3,8.0500,None,S,0
97,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,1,34.6542,A5,C,0
98,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,1,63.3583,D10 D12,C,1
99,"Doling, Mrs. John T (Ada Julia Bone)",female,34.0,0,1,231919,2,23.0000,None,S,1
100,"Kantor, Mr. Sinai",male,34.0,1,0,244367,2,26.0000,None,S,0

<div class="alert alert-success">
    <b>EXERCISE</b>: 인덱스가 10~20인 데이터를 출력하세요. #########
</div>

In [63]:
# [내풀] 리셋 인덱스걸면 PassengerId가 인덱스에서 빠질까?
# 기본 인덱스가 들어가게 하는 법을 모르고있음. #################### d0d

<div class="alert alert-success">
    <b>EXERCISE</b>: 컬럼 이름을 모두 출력하세요.
</div>

In [64]:
pts.columns

Index(['Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Pclass', 'Fare',
       'Cabin', 'Embarked', 'Survived'],
      dtype='object')

<div class="alert alert-success">
    <b>EXERCISE</b>: 데이터의 shape를 확인하세요.
</div>

In [66]:
pts.shape

(891, 11)

<div class="alert alert-success">
    <b>EXERCISE</b>: 'Age' 컬럼의 평균을 구하세요.
</div>

In [67]:
pts['Age'].mean()

np.float64(29.69911764705882)

<div class="alert alert-success">
    <b>EXERCISE</b>: 'Survived' 컬럼의 고유값을 확인하세요.
</div>

In [74]:
pts['Survived'].nunique()

2

<div class="alert alert-success">
    <b>EXERCISE</b>: 나이가 30 이상인 승객만 출력하세요.
</div>

In [75]:
#[내풀] pts['Age'].astype(int) 가 한번에 안됨
pts['Age'].info

<bound method Series.info of PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889     NaN
890    26.0
891    32.0
Name: Age, Length: 891, dtype: float64>

In [82]:
# Nan = 0 으로.
pts.loc[pts['Age'] == 'NaN','Age'] = 0

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,None,S,0
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S,0
...,...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,2,13.0000,None,S,0
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S,1
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,3,23.4500,None,S,0
890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,1,30.0000,C148,C,1
891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,3,7.7500,None,Q,0

In [86]:
pts[pts['Age'] >=30].sort_values('Age',ascending=True)

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
179,"Hale, Mr. Reginald",male,30.0,0,0,250653,2,13.0000,None,S,0
158,"Corn, Mr. Harry",male,30.0,0,0,SOTON/OQ 392090,3,8.0500,None,S,0
727,"Renouf, Mrs. Peter Henry (Lillian Jefferys)",female,30.0,3,0,31027,2,21.0000,None,S,1
214,"Givard, Mr. Hans Kristensen",male,30.0,0,0,250646,2,13.0000,None,S,0
748,"Sinkkonen, Miss. Anna",female,30.0,0,0,250648,2,13.0000,None,S,1
...,...,...,...,...,...,...,...,...,...,...,...
117,"Connors, Mr. Patrick",male,70.5,0,0,370369,3,7.7500,None,Q,0
97,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,1,34.6542,A5,C,0
494,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,1,49.5042,None,C,0
852,"Svensson, Mr. Johan",male,74.0,0,0,347060,3,7.7750,None,S,0
631,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,1,30.0000,A23,S,1

# 30세 이상인 승객만 출력

<div class="alert alert-success">
    <b>EXERCISE</b>: 성별이 'female'이고 생존한 승객만 출력하세요.
</div>

In [87]:
pts[(pts['Sex']=='female') & (pts['Survived']==1)]

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,3,11.1333,None,S,1
10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,2,30.0708,None,C,1
...,...,...,...,...,...,...,...,...,...,...,...
875,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,2,24.0000,None,C,1
876,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,3,7.2250,None,C,1
880,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,1,83.1583,C50,C,1
881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,2,26.0000,None,S,1
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S,1

<div class="alert alert-success">
    <b>EXERCISE</b>: 나이가 10살 이하이고 요금이 20 이상인 승객을 출력하세요.
</div>

In [90]:
pts[(pts['Age']<=10) & (20<=pts['Fare'])]

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
8,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,3,21.0750,None,S,0
17,"Rice, Master. Eugene",male,2.00,4,1,382652,3,29.1250,None,Q,0
25,"Palsson, Miss. Torborg Danira",female,8.00,3,1,349909,3,21.0750,None,S,0
44,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,2,41.5792,None,C,1
51,"Panula, Master. Juha Niilo",male,7.00,4,1,3101295,3,39.6875,None,S,0
59,"West, Miss. Constance Mirium",female,5.00,1,2,C.A. 34651,2,27.7500,None,S,1
64,"Skoog, Master. Harald",male,4.00,3,2,347088,3,27.9000,None,S,0
79,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,2,29.0000,None,S,1
120,"Andersson, Miss. Ellis Anna Maria",female,2.00,4,2,347082,3,31.2750,None,S,0
148,"Ford, Miss. Robina Maggie ""Ruby""",female,9.00,2,2,W./C. 6608,3,34.3750,None,S,0
165,"Panula, Master. Eino Viljami",male,1.00,4,1,3101295,3,39.6875,None,S,0
166,"Goldsmith, Master. Frank John William ""Frankie""",male,9.00,0,2,363291,3,20.5250,None,S,1
172,"Rice, Master. Arthur",male,4.00,4,1,382652,3,29.1250,None,Q,0
183,"Asplund, Master. Clarence Gustaf Hugo",male,9.00,4,2,347077,3,31.3875,None,S,0
184,"Becker, Master. Richard F",male,1.00,2,1,230136,2,39.0000,F4,S,1
185,"Kink-Heilmann, Miss. Luise Gretchen",female,4.00,0,2,315153,3,22.0250,None,S,1
194,"Navratil, Master. Michel M",male,3.00,1,1,230080,2,26.0000,F2,S,1
234,"Asplund, Miss. Lillian Gertrud",female,5.00,4,2,347077,3,31.3875,None,S,1
238,"Collyer, Miss. Marjorie ""Lottie""",female,8.00,0,2,C.A. 31921,2,26.2500,None,S,1
262,"Asplund, Master. Edvin Rojj Felix",male,3.00,4,2,347077,3,31.3875,None,S,1
279,"Rice, Master. Eric",male,7.00,4,1,382652,3,29.1250,None,Q,0
298,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,1,151.5500,C22 C26,S,0
306,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,1,151.5500,C22 C26,S,1
341,"Navratil, Master. Edmond Roger",male,2.00,1,1,230080,2,26.0000,F2,S,1
375,"Palsson, Miss. Stina Viola",female,3.00,3,1,349909,3,21.0750,None,S,0
387,"Goodwin, Master. Sidney Leonard",male,1.00,5,2,CA 2144,3,46.9000,None,S,0
420,"Van Impe, Miss. Catharina",female,10.00,0,2,345773,3,24.1500,None,S,0
446,"Dodge, Master. Washington",male,4.00,0,2,33638,1,81.8583,A34,S,1
481,"Goodwin, Master. Harold Victor",male,9.00,5,2,CA 2144,3,46.9000,None,S,0
531,"Quick, Miss. Phyllis May",female,2.00,1,1,26360,2,26.0000,None,S,1
536,"Hart, Miss. Eva Miriam",female,7.00,0,2,F.C.C. 13529,2,26.2500,None,S,1
542,"Andersson, Miss. Ingeborg Constanzia",female,9.00,4,2,347082,3,31.2750,None,S,0
550,"Davies, Master. John Morgan Jr",male,8.00,1,1,C.A. 33112,2,36.7500,None,S,1
619,"Becker, Miss. Marion Louise",female,4.00,2,1,230136,2,39.0000,F4,S,1
635,"Skoog, Miss. Mabel",female,9.00,3,2,347088,3,27.9000,None,S,0
643,"Skoog, Miss. Margit Elizabeth",female,2.00,3,2,347088,3,27.9000,None,S,0
721,"Harper, Miss. Annie Jessie ""Nina""",female,6.00,0,1,248727,2,33.0000,None,S,1
751,"Wells, Miss. Joan",female,4.00,1,1,29103,2,23.0000,None,S,1
788,"Rice, Master. George Hugh",male,8.00,4,1,382652,3,29.1250,None,Q,0
789,"Dean, Master. Bertram Vere",male,1.00,1,2,C.A. 2315,3,20.5750,None,S,1
814,"Andersson, Miss. Ebba Iris Alfrida",female,6.00,4,2,347082,3,31.2750,None,S,0
820,"Skoog, Master. Karl Thorsten",male,10.00,3,2,347088,3,27.9000,None,S,0
825,"Panula, Master. Urho Abraham",male,2.00,4,1,3101295,3,39.6875,None,S,0
828,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,2,37.0042,None,C,1
851,"Andersson, Master. Sigvard Harald Elias",male,4.00,4,2,347082,3,31.2750,None,S,0

<div class="alert alert-success">
    <b>EXERCISE</b>: 나이가 결측치인 데이터를 출력하세요.
</div>

In [92]:
pts[pts['Age'].isna()]

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
6,"Moran, Mr. James",male,NaN,0,0,330877,3,8.4583,None,Q,0
18,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,2,13.0000,None,S,1
20,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,3,7.2250,None,C,1
27,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,3,7.2250,None,C,0
29,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,3,7.8792,None,Q,1
...,...,...,...,...,...,...,...,...,...,...,...
860,"Razi, Mr. Raihed",male,NaN,0,0,2629,3,7.2292,None,C,0
864,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,3,69.5500,None,S,0
869,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,3,9.5000,None,S,0
879,"Laleff, Mr. Kristo",male,NaN,0,0,349217,3,7.8958,None,S,0
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,3,23.4500,None,S,0

<div class="alert alert-success">
    <b>EXERCISE</b>: 나이를 기준으로 오름차순 정렬하세요. <br>############################Nan이 안사라져요 d0d########
</div>

In [98]:
pts[(pts['Age']!="NaN")].sort_values('Age',ascending=True)

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
804,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,3,8.5167,None,C,1
756,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,2,14.5000,None,S,1
470,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,3,19.2583,None,C,1
645,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,3,19.2583,None,C,1
79,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,2,29.0000,None,S,1
...,...,...,...,...,...,...,...,...,...,...,...
860,"Razi, Mr. Raihed",male,NaN,0,0,2629,3,7.2292,None,C,0
864,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,3,69.5500,None,S,0
869,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,3,9.5000,None,S,0
879,"Laleff, Mr. Kristo",male,NaN,0,0,349217,3,7.8958,None,S,0
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,3,23.4500,None,S,0

<div class="alert alert-success">
    <b>EXERCISE</b>: 요금을 기준으로 내림차순 정렬하고 상위 5명만 출력하세요.
</div>

In [100]:
pts.sort_values('Fare', ascending=False).head(5)

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
738,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,1,512.3292,B101,C,1
680,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,1,512.3292,B51 B53 B55,C,1
259,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,1,512.3292,None,C,1
439,"Fortune, Mr. Mark",male,64.0,1,4,19950,1,263.0000,C23 C25 C27,S,0
89,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,1,263.0000,C23 C25 C27,S,1

<div class="alert alert-success">
    <b>EXERCISE</b>: 성별로 그룹화하여 생존률 평균을 구하세요.
</div>

In [107]:
pts[['Sex','Survived']].groupby('Sex').mean()

        Survived
Sex
female  0.742038
male    0.188908

<div class="alert alert-success">
    <b>EXERCISE</b>: Pclass별 평균 나이를 구하세요.
</div>

In [106]:
pts[['Pclass','Age']].groupby('Pclass').mean()

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

<div class="alert alert-success">
    <b>EXERCISE</b>: 'Age'에 10을 더한 값을 새로운 컬럼 'Age_plus_10'으로 추가하세요.<br> ############# d0d 형변환 외않되???#######
</div>

In [108]:
# 10을 더하려면 int여야하는데 
pts['Age'].info # float

<bound method Series.info of PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889     NaN
890    26.0
891    32.0
Name: Age, Length: 891, dtype: float64>

In [119]:
pts['Age']=pts['Age'].astype(str)
pts['Age'].info

<bound method Series.info of PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889     nan
890    26.0
891    32.0
Name: Age, Length: 891, dtype: object>

In [127]:
int_age=pts[pts['Age']!="nan"]
int_Age=pd.DataFrame(int_age)
int_Age

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,None,S,0
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S,0
...,...,...,...,...,...,...,...,...,...,...,...
886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,3,29.1250,None,Q,0
887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,2,13.0000,None,S,0
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S,1
890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,1,30.0000,C148,C,1
891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,3,7.7500,None,Q,0

In [133]:
int_Age['Age'].astype('float')
int_Age.info()
# 새로 df화 했음에도 object라고 나옴...

<class 'pandas.core.frame.DataFrame'>
Index: 714 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      714 non-null    object
 1   Sex       714 non-null    object
 2   Age       714 non-null    object
 3   SibSp     714 non-null    int64
 4   Parch     714 non-null    int64
 5   Ticket    714 non-null    object
 6   Pclass    714 non-null    int64
 7   Fare      714 non-null    float64
 8   Cabin     185 non-null    object
 9   Embarked  712 non-null    object
 10  Survived  714 non-null    int64
dtypes: float64(1), int64(4), object(6)
memory usage: 66.9+ KB

In [134]:
pts['Age_plus_10']=int_Age.loc[int_Age['Age']+10,'Age']
pts

TypeError: can only concatenate str (not "int") to str

<div class="alert alert-success">
    <b>EXERCISE</b>: 'Age'가 18 이상이면 '성인', 아니면 '미성년'으로 분류하는 컬럼을 추가하세요.
</div>

In [ ]:
# 우선 컬럼을 추가
# '성인'으로 채우고 19세미만은 '미성년'으로 값 바꾸기.
pts['OY']=
(18=<pts['Age'])

<div class="alert alert-success">
    <b>EXERCISE</b>: 'Age'의 결측치를 평균으로 채우세요.
</div>

In [143]:
#[해결?] 평균을 구한다음 
# fillna 사용하기 
# pts['Age'].fillna( round(df['Age'].mean()) )

pts['Age']=pts['Age'].astype('float') #전에 object로 바꿨음..
round(pts['Age'].mean())

30

In [146]:
pts['Age']=pts['Age'].fillna( round(pts['Age'].mean()) )
pts

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,None,S,0
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S,0
...,...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,2,13.0000,None,S,0
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S,1
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,30.0,1,2,W./C. 6607,3,23.4500,None,S,0
890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,1,30.0000,C148,C,1
891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,3,7.7500,None,Q,0

<div class="alert alert-success">
    <b>EXERCISE</b>: 'Cabin' 컬럼의 결측치를 'Unknown'으로 채우세요.
</div>

In [148]:
pts['Cabin'].isna().sum()

np.int64(687)

In [149]:
pts['Cabin']=pts['Cabin'].fillna( "Unknown" )
pts['Cabin'].isna().sum()

np.int64(0)

<div class="alert alert-success">
    <b>EXERCISE</b>: 중복된 'Ticket' 값을 제거하고 몇 개가 남는지 출력하세요.
</div>

In [ ]:
# 중복 찾기

<div class="alert alert-success">
    <b>EXERCISE</b>: 'Embarked' 컬럼의 고유값과 각각의 개수를 출력하세요.
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: 인덱스를 'PassengerId'로 설정하세요.
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: 인덱스를 초기화하세요.
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: 성별과 Pclass의 생존률을 피벗 테이블로 만드세요.
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: groupby()를 사용하여 각 성별(sex)의 평균 나이(age)를 구하세요.
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: 전체 승객(passenger)의 평균 생존율을 구하세요.
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: 25세 이하 승객의 생존율을 구하세요. (힌트: 불리언 인덱싱)
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: 남성의 생존율을 구하세요. 여성의 생존율을 구하세요. (힌트: 불리언 인덱싱)
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: 생존율을 구하는 함수가 작성되어 있습니다. 성별 생존율을 groupby를 활용해 구하기 위해 ?부분을 알맞게 채워주세요.
</div>

In [33]:
def survival_ratio(survived):
    return survived.sum() / len(survived)